Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32H747/Includes/Registers/stm32H747_CM7_otg2_hs_host.h
// OTG_HS_HCTSIZ6 Configuration

#define OTG2_HS_HOST_OTG_HS_HCTSIZ6_DPID        (0x3u<<29)
#define OTG2_HS_HOST_OTG_HS_HCTSIZ6_DPID_0      (0x1u<<29)
#define OTG2_HS_HOST_OTG_HS_HCTSIZ6_PKTCNT      (0x3FFu<<19)
#define OTG2_HS_HOST_OTG_HS_HCTSIZ6_PKTCNT_0    (0x1u<<19)
#define OTG2_HS_HOST_OTG_HS_HCTSIZ6_XFRSIZ      (0x7FFFFu<<0)
#define OTG2_HS_HOST_OTG_HS_HCTSIZ6_XFRSIZ_0    (0x1u<<0)

// OTG_HS_HCDMA6 Configuration

#define OTG2_HS_HOST_OTG_HS_HCDMA6_DMAADDR      (0xFFFFFFFFu<<0)
#define OTG2_HS_HOST_OTG_HS_HCDMA6_DMAADDR_0    (0x1u<<0)

// OTG_HS_HCCHAR7 Configuration

#define OTG2_HS_HOST_OTG_HS_HCCHAR7_CHENA       (0x1u<<31)
#define OTG2_HS_HOST_OTG_HS_HCCHAR7_CHDIS       (0x1u<<30)
#define OTG2_HS_HOST_OTG_HS_HCCHAR7_ODDFRM      (0x1u<<29)
#define OTG2_HS_HOST_OTG_HS_HCCHAR7_DAD         (0x7Fu<<22)
#define OTG2_HS_HOST_OTG_HS_HCCHAR7_DAD_0       (0x1u<<22)
#define OTG2_HS_HOST_OTG_HS_HCCHAR7_MC          (0x3u<<20)
#define OTG2_HS_HOST_OTG_HS_HCCHAR7_MC_0        (0x1u<<20)
#define OTG2_HS_HOST_OTG_HS_HCCHAR7_EPTYP       (0x3u<<18)
#define OTG2_HS_HOST_OTG_HS_HCCHAR7_EPTYP_0     (0x1u<<18)
#define OTG2_HS_HOST_OTG_HS_HCCHAR7_LSDEV       (0x1u<<17)
#define OTG2_HS_HOST_OTG_HS_HCCHAR7_EPDIR       (0x1u<<15)
#define OTG2_HS_HOST_OTG_HS_HCCHAR7_EPNUM       (0xFu<<11)
#define OTG2_HS_HOST_OTG_HS_HCCHAR7_EPNUM_0     (0x1u<<11)
#define OTG2_HS_HOST_OTG_HS_HCCHAR7_MPSIZ       (0x7FFu<<0)
#define OTG2_HS_HOST_OTG_HS_HCCHAR7_MPSIZ_0     (0x1u<<0)

// OTG_HS_HCSPLT7 Configuration

#define OTG2_HS_HOST_OTG_HS_HCSPLT7_SPLITEN     (0x1u<<31)
#define OTG2_HS_HOST_OTG_HS_HCSPLT7_COMPLSPLT   (0x1u<<16)
#define OTG2_HS_HOST_OTG_HS_HCSPLT7_XACTPOS     (0x3u<<14)
#define OTG2_HS_HOST_OTG_HS_HCSPLT7_XACTPOS_0   (0x1u<<14)
#define OTG2_HS_HOST_OTG_HS_HCSPLT7_HUBADDR     (0x7Fu<<7)
#define OTG2_HS_HOST_OTG_HS_HCSPLT7_HUBADDR_0   (0x1u<<7)
#define OTG2_HS_HOST_OTG_HS_HCSPLT7_PRTADDR     (0x7Fu<<0)
#define OTG2_HS_HOST_OTG_HS_HCSPLT7_PRTADDR_0   (0x1u<<0)

// OTG_HS_HCINT7 Configuration

#define OTG2_HS_HOST_OTG_HS_HCINT7_DTERR        (0x1u<<10)
#define OTG2_HS_HOST_OTG_HS_HCINT7_FRMOR        (0x1u<<9)
#define OTG2_HS_HOST_OTG_HS_HCINT7_BBERR        (0x1u<<8)
#define OTG2_HS_HOST_OTG_HS_HCINT7_TXERR        (0x1u<<7)
#define OTG2_HS_HOST_OTG_HS_HCINT7_NYET         (0x1u<<6)
#define OTG2_HS_HOST_OTG_HS_HCINT7_ACK          (0x1u<<5)
#define OTG2_HS_HOST_OTG_HS_HCINT7_NAK          (0x1u<<4)
#define OTG2_HS_HOST_OTG_HS_HCINT7_STALL        (0x1u<<3)
#define OTG2_HS_HOST_OTG_HS_HCINT7_AHBERR       (0x1u<<2)
#define OTG2_HS_HOST_OTG_HS_HCINT7_CHH          (0x1u<<1)
#define OTG2_HS_HOST_OTG_HS_HCINT7_XFRC         (0x1u<<0)

// OTG_HS_HCINTMSK7 Configuration

#define OTG2_HS_HOST_OTG_HS_HCINTMSK7_DTERRM    (0x1u<<10)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK7_FRMORM    (0x1u<<9)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK7_BBERRM    (0x1u<<8)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK7_TXERRM    (0x1u<<7)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK7_NYET      (0x1u<<6)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK7_ACKM      (0x1u<<5)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK7_NAKM      (0x1u<<4)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK7_STALLM    (0x1u<<3)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK7_AHBERR    (0x1u<<2)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK7_CHHM      (0x1u<<1)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK7_XFRCM     (0x1u<<0)

// OTG_HS_HCTSIZ7 Configuration

#define OTG2_HS_HOST_OTG_HS_HCTSIZ7_DPID        (0x3u<<29)
#define OTG2_HS_HOST_OTG_HS_HCTSIZ7_DPID_0      (0x1u<<29)
#define OTG2_HS_HOST_OTG_HS_HCTSIZ7_PKTCNT      (0x3FFu<<19)
#define OTG2_HS_HOST_OTG_HS_HCTSIZ7_PKTCNT_0    (0x1u<<19)
#define OTG2_HS_HOST_OTG_HS_HCTSIZ7_XFRSIZ      (0x7FFFFu<<0)
#define OTG2_HS_HOST_OTG_HS_HCTSIZ7_XFRSIZ_0    (0x1u<<0)

// OTG_HS_HCDMA7 Configuration

#define OTG2_HS_HOST_OTG_HS_HCDMA7_DMAADDR      (0xFFFFFFFFu<<0)
#define OTG2_HS_HOST_OTG_HS_HCDMA7_DMAADDR_0    (0x1u<<0)

// OTG_HS_HCCHAR8 Configuration

#define OTG2_HS_HOST_OTG_HS_HCCHAR8_CHENA       (0x1u<<31)
#define OTG2_HS_HOST_OTG_HS_HCCHAR8_CHDIS       (0x1u<<30)
#define OTG2_HS_HOST_OTG_HS_HCCHAR8_ODDFRM      (0x1u<<29)
#define OTG2_HS_HOST_OTG_HS_HCCHAR8_DAD         (0x7Fu<<22)
#define OTG2_HS_HOST_OTG_HS_HCCHAR8_DAD_0       (0x1u<<22)
#define OTG2_HS_HOST_OTG_HS_HCCHAR8_MC          (0x3u<<20)
#define OTG2_HS_HOST_OTG_HS_HCCHAR8_MC_0        (0x1u<<20)
#define OTG2_HS_HOST_OTG_HS_HCCHAR8_EPTYP       (0x3u<<18)
#define OTG2_HS_HOST_OTG_HS_HCCHAR8_EPTYP_0     (0x1u<<18)
#define OTG2_HS_HOST_OTG_HS_HCCHAR8_LSDEV       (0x1u<<17)
#define OTG2_HS_HOST_OTG_HS_HCCHAR8_EPDIR       (0x1u<<15)
#define OTG2_HS_HOST_OTG_HS_HCCHAR8_EPNUM       (0xFu<<11)
#define OTG2_HS_HOST_OTG_HS_HCCHAR8_EPNUM_0     (0x1u<<11)
#define OTG2_HS_HOST_OTG_HS_HCCHAR8_MPSIZ       (0x7FFu<<0)
#define OTG2_HS_HOST_OTG_HS_HCCHAR8_MPSIZ_0     (0x1u<<0)

// OTG_HS_HCSPLT8 Configuration

#define OTG2_HS_HOST_OTG_HS_HCSPLT8_SPLITEN     (0x1u<<31)
#define OTG2_HS_HOST_OTG_HS_HCSPLT8_COMPLSPLT   (0x1u<<16)
#define OTG2_HS_HOST_OTG_HS_HCSPLT8_XACTPOS     (0x3u<<14)
#define OTG2_HS_HOST_OTG_HS_HCSPLT8_XACTPOS_0   (0x1u<<14)
#define OTG2_HS_HOST_OTG_HS_HCSPLT8_HUBADDR     (0x7Fu<<7)
#define OTG2_HS_HOST_OTG_HS_HCSPLT8_HUBADDR_0   (0x1u<<7)
#define OTG2_HS_HOST_OTG_HS_HCSPLT8_PRTADDR     (0x7Fu<<0)
#define OTG2_HS_HOST_OTG_HS_HCSPLT8_PRTADDR_0   (0x1u<<0)

// OTG_HS_HCINT8 Configuration

#define OTG2_HS_HOST_OTG_HS_HCINT8_DTERR        (0x1u<<10)
#define OTG2_HS_HOST_OTG_HS_HCINT8_FRMOR        (0x1u<<9)
#define OTG2_HS_HOST_OTG_HS_HCINT8_BBERR        (0x1u<<8)
#define OTG2_HS_HOST_OTG_HS_HCINT8_TXERR        (0x1u<<7)
#define OTG2_HS_HOST_OTG_HS_HCINT8_NYET         (0x1u<<6)
#define OTG2_HS_HOST_OTG_HS_HCINT8_ACK          (0x1u<<5)
#define OTG2_HS_HOST_OTG_HS_HCINT8_NAK          (0x1u<<4)
#define OTG2_HS_HOST_OTG_HS_HCINT8_STALL        (0x1u<<3)
#define OTG2_HS_HOST_OTG_HS_HCINT8_AHBERR       (0x1u<<2)
#define OTG2_HS_HOST_OTG_HS_HCINT8_CHH          (0x1u<<1)
#define OTG2_HS_HOST_OTG_HS_HCINT8_XFRC         (0x1u<<0)

// OTG_HS_HCINTMSK8 Configuration

#define OTG2_HS_HOST_OTG_HS_HCINTMSK8_DTERRM    (0x1u<<10)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK8_FRMORM    (0x1u<<9)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK8_BBERRM    (0x1u<<8)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK8_TXERRM    (0x1u<<7)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK8_NYET      (0x1u<<6)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK8_ACKM      (0x1u<<5)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK8_NAKM      (0x1u<<4)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK8_STALLM    (0x1u<<3)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK8_AHBERR    (0x1u<<2)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK8_CHHM      (0x1u<<1)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK8_XFRCM     (0x1u<<0)

// OTG_HS_HCTSIZ8 Configuration

#define OTG2_HS_HOST_OTG_HS_HCTSIZ8_DPID        (0x3u<<29)
#define OTG2_HS_HOST_OTG_HS_HCTSIZ8_DPID_0      (0x1u<<29)
#define OTG2_HS_HOST_OTG_HS_HCTSIZ8_PKTCNT      (0x3FFu<<19)
#define OTG2_HS_HOST_OTG_HS_HCTSIZ8_PKTCNT_0    (0x1u<<19)
#define OTG2_HS_HOST_OTG_HS_HCTSIZ8_XFRSIZ      (0x7FFFFu<<0)
#define OTG2_HS_HOST_OTG_HS_HCTSIZ8_XFRSIZ_0    (0x1u<<0)

// OTG_HS_HCDMA8 Configuration

