Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32H747/Includes/Registers/stm32H747_CM7_otg2_hs_host.h
#define OTG2_HS_HOST_OTG_HS_HCDMA8_DMAADDR      (0xFFFFFFFFu<<0)
#define OTG2_HS_HOST_OTG_HS_HCDMA8_DMAADDR_0    (0x1u<<0)

// OTG_HS_HCCHAR9 Configuration

#define OTG2_HS_HOST_OTG_HS_HCCHAR9_CHENA       (0x1u<<31)
#define OTG2_HS_HOST_OTG_HS_HCCHAR9_CHDIS       (0x1u<<30)
#define OTG2_HS_HOST_OTG_HS_HCCHAR9_ODDFRM      (0x1u<<29)
#define OTG2_HS_HOST_OTG_HS_HCCHAR9_DAD         (0x7Fu<<22)
#define OTG2_HS_HOST_OTG_HS_HCCHAR9_DAD_0       (0x1u<<22)
#define OTG2_HS_HOST_OTG_HS_HCCHAR9_MC          (0x3u<<20)
#define OTG2_HS_HOST_OTG_HS_HCCHAR9_MC_0        (0x1u<<20)
#define OTG2_HS_HOST_OTG_HS_HCCHAR9_EPTYP       (0x3u<<18)
#define OTG2_HS_HOST_OTG_HS_HCCHAR9_EPTYP_0     (0x1u<<18)
#define OTG2_HS_HOST_OTG_HS_HCCHAR9_LSDEV       (0x1u<<17)
#define OTG2_HS_HOST_OTG_HS_HCCHAR9_EPDIR       (0x1u<<15)
#define OTG2_HS_HOST_OTG_HS_HCCHAR9_EPNUM       (0xFu<<11)
#define OTG2_HS_HOST_OTG_HS_HCCHAR9_EPNUM_0     (0x1u<<11)
#define OTG2_HS_HOST_OTG_HS_HCCHAR9_MPSIZ       (0x7FFu<<0)
#define OTG2_HS_HOST_OTG_HS_HCCHAR9_MPSIZ_0     (0x1u<<0)

// OTG_HS_HCSPLT9 Configuration

#define OTG2_HS_HOST_OTG_HS_HCSPLT9_SPLITEN     (0x1u<<31)
#define OTG2_HS_HOST_OTG_HS_HCSPLT9_COMPLSPLT   (0x1u<<16)
#define OTG2_HS_HOST_OTG_HS_HCSPLT9_XACTPOS     (0x3u<<14)
#define OTG2_HS_HOST_OTG_HS_HCSPLT9_XACTPOS_0   (0x1u<<14)
#define OTG2_HS_HOST_OTG_HS_HCSPLT9_HUBADDR     (0x7Fu<<7)
#define OTG2_HS_HOST_OTG_HS_HCSPLT9_HUBADDR_0   (0x1u<<7)
#define OTG2_HS_HOST_OTG_HS_HCSPLT9_PRTADDR     (0x7Fu<<0)
#define OTG2_HS_HOST_OTG_HS_HCSPLT9_PRTADDR_0   (0x1u<<0)

// OTG_HS_HCINT9 Configuration

#define OTG2_HS_HOST_OTG_HS_HCINT9_DTERR        (0x1u<<10)
#define OTG2_HS_HOST_OTG_HS_HCINT9_FRMOR        (0x1u<<9)
#define OTG2_HS_HOST_OTG_HS_HCINT9_BBERR        (0x1u<<8)
#define OTG2_HS_HOST_OTG_HS_HCINT9_TXERR        (0x1u<<7)
#define OTG2_HS_HOST_OTG_HS_HCINT9_NYET         (0x1u<<6)
#define OTG2_HS_HOST_OTG_HS_HCINT9_ACK          (0x1u<<5)
#define OTG2_HS_HOST_OTG_HS_HCINT9_NAK          (0x1u<<4)
#define OTG2_HS_HOST_OTG_HS_HCINT9_STALL        (0x1u<<3)
#define OTG2_HS_HOST_OTG_HS_HCINT9_AHBERR       (0x1u<<2)
#define OTG2_HS_HOST_OTG_HS_HCINT9_CHH          (0x1u<<1)
#define OTG2_HS_HOST_OTG_HS_HCINT9_XFRC         (0x1u<<0)

// OTG_HS_HCINTMSK9 Configuration

#define OTG2_HS_HOST_OTG_HS_HCINTMSK9_DTERRM    (0x1u<<10)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK9_FRMORM    (0x1u<<9)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK9_BBERRM    (0x1u<<8)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK9_TXERRM    (0x1u<<7)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK9_NYET      (0x1u<<6)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK9_ACKM      (0x1u<<5)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK9_NAKM      (0x1u<<4)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK9_STALLM    (0x1u<<3)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK9_AHBERR    (0x1u<<2)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK9_CHHM      (0x1u<<1)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK9_XFRCM     (0x1u<<0)

// OTG_HS_HCTSIZ9 Configuration

#define OTG2_HS_HOST_OTG_HS_HCTSIZ9_DPID        (0x3u<<29)
#define OTG2_HS_HOST_OTG_HS_HCTSIZ9_DPID_0      (0x1u<<29)
#define OTG2_HS_HOST_OTG_HS_HCTSIZ9_PKTCNT      (0x3FFu<<19)
#define OTG2_HS_HOST_OTG_HS_HCTSIZ9_PKTCNT_0    (0x1u<<19)
#define OTG2_HS_HOST_OTG_HS_HCTSIZ9_XFRSIZ      (0x7FFFFu<<0)
#define OTG2_HS_HOST_OTG_HS_HCTSIZ9_XFRSIZ_0    (0x1u<<0)

// OTG_HS_HCDMA9 Configuration

#define OTG2_HS_HOST_OTG_HS_HCDMA9_DMAADDR      (0xFFFFFFFFu<<0)
#define OTG2_HS_HOST_OTG_HS_HCDMA9_DMAADDR_0    (0x1u<<0)

// OTG_HS_HCCHAR10 Configuration

#define OTG2_HS_HOST_OTG_HS_HCCHAR10_CHENA      (0x1u<<31)
#define OTG2_HS_HOST_OTG_HS_HCCHAR10_CHDIS      (0x1u<<30)
#define OTG2_HS_HOST_OTG_HS_HCCHAR10_ODDFRM     (0x1u<<29)
#define OTG2_HS_HOST_OTG_HS_HCCHAR10_DAD        (0x7Fu<<22)
#define OTG2_HS_HOST_OTG_HS_HCCHAR10_DAD_0      (0x1u<<22)
#define OTG2_HS_HOST_OTG_HS_HCCHAR10_MC         (0x3u<<20)
#define OTG2_HS_HOST_OTG_HS_HCCHAR10_MC_0       (0x1u<<20)
#define OTG2_HS_HOST_OTG_HS_HCCHAR10_EPTYP      (0x3u<<18)
#define OTG2_HS_HOST_OTG_HS_HCCHAR10_EPTYP_0    (0x1u<<18)
#define OTG2_HS_HOST_OTG_HS_HCCHAR10_LSDEV      (0x1u<<17)
#define OTG2_HS_HOST_OTG_HS_HCCHAR10_EPDIR      (0x1u<<15)
#define OTG2_HS_HOST_OTG_HS_HCCHAR10_EPNUM      (0xFu<<11)
#define OTG2_HS_HOST_OTG_HS_HCCHAR10_EPNUM_0    (0x1u<<11)
#define OTG2_HS_HOST_OTG_HS_HCCHAR10_MPSIZ      (0x7FFu<<0)
#define OTG2_HS_HOST_OTG_HS_HCCHAR10_MPSIZ_0    (0x1u<<0)

// OTG_HS_HCSPLT10 Configuration

#define OTG2_HS_HOST_OTG_HS_HCSPLT10_SPLITEN    (0x1u<<31)
#define OTG2_HS_HOST_OTG_HS_HCSPLT10_COMPLSPLT  (0x1u<<16)
#define OTG2_HS_HOST_OTG_HS_HCSPLT10_XACTPOS    (0x3u<<14)
#define OTG2_HS_HOST_OTG_HS_HCSPLT10_XACTPOS_0  (0x1u<<14)
#define OTG2_HS_HOST_OTG_HS_HCSPLT10_HUBADDR    (0x7Fu<<7)
#define OTG2_HS_HOST_OTG_HS_HCSPLT10_HUBADDR_0  (0x1u<<7)
#define OTG2_HS_HOST_OTG_HS_HCSPLT10_PRTADDR    (0x7Fu<<0)
#define OTG2_HS_HOST_OTG_HS_HCSPLT10_PRTADDR_0  (0x1u<<0)

// OTG_HS_HCINT10 Configuration

#define OTG2_HS_HOST_OTG_HS_HCINT10_DTERR       (0x1u<<10)
#define OTG2_HS_HOST_OTG_HS_HCINT10_FRMOR       (0x1u<<9)
#define OTG2_HS_HOST_OTG_HS_HCINT10_BBERR       (0x1u<<8)
#define OTG2_HS_HOST_OTG_HS_HCINT10_TXERR       (0x1u<<7)
#define OTG2_HS_HOST_OTG_HS_HCINT10_NYET        (0x1u<<6)
#define OTG2_HS_HOST_OTG_HS_HCINT10_ACK         (0x1u<<5)
#define OTG2_HS_HOST_OTG_HS_HCINT10_NAK         (0x1u<<4)
#define OTG2_HS_HOST_OTG_HS_HCINT10_STALL       (0x1u<<3)
#define OTG2_HS_HOST_OTG_HS_HCINT10_AHBERR      (0x1u<<2)
#define OTG2_HS_HOST_OTG_HS_HCINT10_CHH         (0x1u<<1)
#define OTG2_HS_HOST_OTG_HS_HCINT10_XFRC        (0x1u<<0)

// OTG_HS_HCINTMSK10 Configuration

#define OTG2_HS_HOST_OTG_HS_HCINTMSK10_DTERRM   (0x1u<<10)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK10_FRMORM   (0x1u<<9)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK10_BBERRM   (0x1u<<8)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK10_TXERRM   (0x1u<<7)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK10_NYET     (0x1u<<6)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK10_ACKM     (0x1u<<5)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK10_NAKM     (0x1u<<4)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK10_STALLM   (0x1u<<3)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK10_AHBERR   (0x1u<<2)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK10_CHHM     (0x1u<<1)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK10_XFRCM    (0x1u<<0)

// OTG_HS_HCTSIZ10 Configuration

