Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32H747/Includes/Registers/stm32H747_CM7_otg2_hs_host.h
#define OTG2_HS_HOST_OTG_HS_HCTSIZ10_DPID       (0x3u<<29)
#define OTG2_HS_HOST_OTG_HS_HCTSIZ10_DPID_0     (0x1u<<29)
#define OTG2_HS_HOST_OTG_HS_HCTSIZ10_PKTCNT     (0x3FFu<<19)
#define OTG2_HS_HOST_OTG_HS_HCTSIZ10_PKTCNT_0   (0x1u<<19)
#define OTG2_HS_HOST_OTG_HS_HCTSIZ10_XFRSIZ     (0x7FFFFu<<0)
#define OTG2_HS_HOST_OTG_HS_HCTSIZ10_XFRSIZ_0   (0x1u<<0)

// OTG_HS_HCDMA10 Configuration

#define OTG2_HS_HOST_OTG_HS_HCDMA10_DMAADDR     (0xFFFFFFFFu<<0)
#define OTG2_HS_HOST_OTG_HS_HCDMA10_DMAADDR_0   (0x1u<<0)

// OTG_HS_HCCHAR11 Configuration

#define OTG2_HS_HOST_OTG_HS_HCCHAR11_CHENA      (0x1u<<31)
#define OTG2_HS_HOST_OTG_HS_HCCHAR11_CHDIS      (0x1u<<30)
#define OTG2_HS_HOST_OTG_HS_HCCHAR11_ODDFRM     (0x1u<<29)
#define OTG2_HS_HOST_OTG_HS_HCCHAR11_DAD        (0x7Fu<<22)
#define OTG2_HS_HOST_OTG_HS_HCCHAR11_DAD_0      (0x1u<<22)
#define OTG2_HS_HOST_OTG_HS_HCCHAR11_MC         (0x3u<<20)
#define OTG2_HS_HOST_OTG_HS_HCCHAR11_MC_0       (0x1u<<20)
#define OTG2_HS_HOST_OTG_HS_HCCHAR11_EPTYP      (0x3u<<18)
#define OTG2_HS_HOST_OTG_HS_HCCHAR11_EPTYP_0    (0x1u<<18)
#define OTG2_HS_HOST_OTG_HS_HCCHAR11_LSDEV      (0x1u<<17)
#define OTG2_HS_HOST_OTG_HS_HCCHAR11_EPDIR      (0x1u<<15)
#define OTG2_HS_HOST_OTG_HS_HCCHAR11_EPNUM      (0xFu<<11)
#define OTG2_HS_HOST_OTG_HS_HCCHAR11_EPNUM_0    (0x1u<<11)
#define OTG2_HS_HOST_OTG_HS_HCCHAR11_MPSIZ      (0x7FFu<<0)
#define OTG2_HS_HOST_OTG_HS_HCCHAR11_MPSIZ_0    (0x1u<<0)

// OTG_HS_HCSPLT11 Configuration

#define OTG2_HS_HOST_OTG_HS_HCSPLT11_SPLITEN    (0x1u<<31)
#define OTG2_HS_HOST_OTG_HS_HCSPLT11_COMPLSPLT  (0x1u<<16)
#define OTG2_HS_HOST_OTG_HS_HCSPLT11_XACTPOS    (0x3u<<14)
#define OTG2_HS_HOST_OTG_HS_HCSPLT11_XACTPOS_0  (0x1u<<14)
#define OTG2_HS_HOST_OTG_HS_HCSPLT11_HUBADDR    (0x7Fu<<7)
#define OTG2_HS_HOST_OTG_HS_HCSPLT11_HUBADDR_0  (0x1u<<7)
#define OTG2_HS_HOST_OTG_HS_HCSPLT11_PRTADDR    (0x7Fu<<0)
#define OTG2_HS_HOST_OTG_HS_HCSPLT11_PRTADDR_0  (0x1u<<0)

// OTG_HS_HCINT11 Configuration

#define OTG2_HS_HOST_OTG_HS_HCINT11_DTERR       (0x1u<<10)
#define OTG2_HS_HOST_OTG_HS_HCINT11_FRMOR       (0x1u<<9)
#define OTG2_HS_HOST_OTG_HS_HCINT11_BBERR       (0x1u<<8)
#define OTG2_HS_HOST_OTG_HS_HCINT11_TXERR       (0x1u<<7)
#define OTG2_HS_HOST_OTG_HS_HCINT11_NYET        (0x1u<<6)
#define OTG2_HS_HOST_OTG_HS_HCINT11_ACK         (0x1u<<5)
#define OTG2_HS_HOST_OTG_HS_HCINT11_NAK         (0x1u<<4)
#define OTG2_HS_HOST_OTG_HS_HCINT11_STALL       (0x1u<<3)
#define OTG2_HS_HOST_OTG_HS_HCINT11_AHBERR      (0x1u<<2)
#define OTG2_HS_HOST_OTG_HS_HCINT11_CHH         (0x1u<<1)
#define OTG2_HS_HOST_OTG_HS_HCINT11_XFRC        (0x1u<<0)

// OTG_HS_HCINTMSK11 Configuration

#define OTG2_HS_HOST_OTG_HS_HCINTMSK11_DTERRM   (0x1u<<10)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK11_FRMORM   (0x1u<<9)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK11_BBERRM   (0x1u<<8)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK11_TXERRM   (0x1u<<7)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK11_NYET     (0x1u<<6)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK11_ACKM     (0x1u<<5)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK11_NAKM     (0x1u<<4)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK11_STALLM   (0x1u<<3)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK11_AHBERR   (0x1u<<2)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK11_CHHM     (0x1u<<1)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK11_XFRCM    (0x1u<<0)

// OTG_HS_HCTSIZ11 Configuration

#define OTG2_HS_HOST_OTG_HS_HCTSIZ11_DPID       (0x3u<<29)
#define OTG2_HS_HOST_OTG_HS_HCTSIZ11_DPID_0     (0x1u<<29)
#define OTG2_HS_HOST_OTG_HS_HCTSIZ11_PKTCNT     (0x3FFu<<19)
#define OTG2_HS_HOST_OTG_HS_HCTSIZ11_PKTCNT_0   (0x1u<<19)
#define OTG2_HS_HOST_OTG_HS_HCTSIZ11_XFRSIZ     (0x7FFFFu<<0)
#define OTG2_HS_HOST_OTG_HS_HCTSIZ11_XFRSIZ_0   (0x1u<<0)

// OTG_HS_HCDMA11 Configuration

#define OTG2_HS_HOST_OTG_HS_HCDMA11_DMAADDR     (0xFFFFFFFFu<<0)
#define OTG2_HS_HOST_OTG_HS_HCDMA11_DMAADDR_0   (0x1u<<0)

// OTG_HS_HCCHAR12 Configuration

#define OTG2_HS_HOST_OTG_HS_HCCHAR12_CHENA      (0x1u<<31)
#define OTG2_HS_HOST_OTG_HS_HCCHAR12_CHDIS      (0x1u<<30)
#define OTG2_HS_HOST_OTG_HS_HCCHAR12_ODDFRM     (0x1u<<29)
#define OTG2_HS_HOST_OTG_HS_HCCHAR12_DAD        (0x7Fu<<22)
#define OTG2_HS_HOST_OTG_HS_HCCHAR12_DAD_0      (0x1u<<22)
#define OTG2_HS_HOST_OTG_HS_HCCHAR12_MC         (0x3u<<20)
#define OTG2_HS_HOST_OTG_HS_HCCHAR12_MC_0       (0x1u<<20)
#define OTG2_HS_HOST_OTG_HS_HCCHAR12_EPTYP      (0x3u<<18)
#define OTG2_HS_HOST_OTG_HS_HCCHAR12_EPTYP_0    (0x1u<<18)
#define OTG2_HS_HOST_OTG_HS_HCCHAR12_LSDEV      (0x1u<<17)
#define OTG2_HS_HOST_OTG_HS_HCCHAR12_EPDIR      (0x1u<<15)
#define OTG2_HS_HOST_OTG_HS_HCCHAR12_EPNUM      (0xFu<<11)
#define OTG2_HS_HOST_OTG_HS_HCCHAR12_EPNUM_0    (0x1u<<11)
#define OTG2_HS_HOST_OTG_HS_HCCHAR12_MPSIZ      (0x7FFu<<0)
#define OTG2_HS_HOST_OTG_HS_HCCHAR12_MPSIZ_0    (0x1u<<0)

// OTG_HS_HCSPLT12 Configuration

#define OTG2_HS_HOST_OTG_HS_HCSPLT12_SPLITEN    (0x1u<<31)
#define OTG2_HS_HOST_OTG_HS_HCSPLT12_COMPLSPLT  (0x1u<<16)
#define OTG2_HS_HOST_OTG_HS_HCSPLT12_XACTPOS    (0x3u<<14)
#define OTG2_HS_HOST_OTG_HS_HCSPLT12_XACTPOS_0  (0x1u<<14)
#define OTG2_HS_HOST_OTG_HS_HCSPLT12_HUBADDR    (0x7Fu<<7)
#define OTG2_HS_HOST_OTG_HS_HCSPLT12_HUBADDR_0  (0x1u<<7)
#define OTG2_HS_HOST_OTG_HS_HCSPLT12_PRTADDR    (0x7Fu<<0)
#define OTG2_HS_HOST_OTG_HS_HCSPLT12_PRTADDR_0  (0x1u<<0)

// OTG_HS_HCINT12 Configuration

#define OTG2_HS_HOST_OTG_HS_HCINT12_DTERR       (0x1u<<10)
#define OTG2_HS_HOST_OTG_HS_HCINT12_FRMOR       (0x1u<<9)
#define OTG2_HS_HOST_OTG_HS_HCINT12_BBERR       (0x1u<<8)
#define OTG2_HS_HOST_OTG_HS_HCINT12_TXERR       (0x1u<<7)
#define OTG2_HS_HOST_OTG_HS_HCINT12_NYET        (0x1u<<6)
#define OTG2_HS_HOST_OTG_HS_HCINT12_ACK         (0x1u<<5)
#define OTG2_HS_HOST_OTG_HS_HCINT12_NAK         (0x1u<<4)
#define OTG2_HS_HOST_OTG_HS_HCINT12_STALL       (0x1u<<3)
#define OTG2_HS_HOST_OTG_HS_HCINT12_AHBERR      (0x1u<<2)
#define OTG2_HS_HOST_OTG_HS_HCINT12_CHH         (0x1u<<1)
#define OTG2_HS_HOST_OTG_HS_HCINT12_XFRC        (0x1u<<0)

// OTG_HS_HCINTMSK12 Configuration

#define OTG2_HS_HOST_OTG_HS_HCINTMSK12_DTERRM   (0x1u<<10)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK12_FRMORM   (0x1u<<9)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK12_BBERRM   (0x1u<<8)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK12_TXERRM   (0x1u<<7)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK12_NYET     (0x1u<<6)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK12_ACKM     (0x1u<<5)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK12_NAKM     (0x1u<<4)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK12_STALLM   (0x1u<<3)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK12_AHBERR   (0x1u<<2)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK12_CHHM     (0x1u<<1)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK12_XFRCM    (0x1u<<0)

// OTG_HS_HCTSIZ12 Configuration

#define OTG2_HS_HOST_OTG_HS_HCTSIZ12_DPID       (0x3u<<29)
#define OTG2_HS_HOST_OTG_HS_HCTSIZ12_DPID_0     (0x1u<<29)
#define OTG2_HS_HOST_OTG_HS_HCTSIZ12_PKTCNT     (0x3FFu<<19)
#define OTG2_HS_HOST_OTG_HS_HCTSIZ12_PKTCNT_0   (0x1u<<19)
#define OTG2_HS_HOST_OTG_HS_HCTSIZ12_XFRSIZ     (0x7FFFFu<<0)
#define OTG2_HS_HOST_OTG_HS_HCTSIZ12_XFRSIZ_0   (0x1u<<0)

