Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32H747/Includes/Registers/stm32H747_CM7_otg2_hs_host.h
// OTG_HS_HCDMA12 Configuration

#define OTG2_HS_HOST_OTG_HS_HCDMA12_DMAADDR     (0xFFFFFFFFu<<0)
#define OTG2_HS_HOST_OTG_HS_HCDMA12_DMAADDR_0   (0x1u<<0)

// OTG_HS_HCCHAR13 Configuration

#define OTG2_HS_HOST_OTG_HS_HCCHAR13_CHENA      (0x1u<<31)
#define OTG2_HS_HOST_OTG_HS_HCCHAR13_CHDIS      (0x1u<<30)
#define OTG2_HS_HOST_OTG_HS_HCCHAR13_ODDFRM     (0x1u<<29)
#define OTG2_HS_HOST_OTG_HS_HCCHAR13_DAD        (0x7Fu<<22)
#define OTG2_HS_HOST_OTG_HS_HCCHAR13_DAD_0      (0x1u<<22)
#define OTG2_HS_HOST_OTG_HS_HCCHAR13_MC         (0x3u<<20)
#define OTG2_HS_HOST_OTG_HS_HCCHAR13_MC_0       (0x1u<<20)
#define OTG2_HS_HOST_OTG_HS_HCCHAR13_EPTYP      (0x3u<<18)
#define OTG2_HS_HOST_OTG_HS_HCCHAR13_EPTYP_0    (0x1u<<18)
#define OTG2_HS_HOST_OTG_HS_HCCHAR13_LSDEV      (0x1u<<17)
#define OTG2_HS_HOST_OTG_HS_HCCHAR13_EPDIR      (0x1u<<15)
#define OTG2_HS_HOST_OTG_HS_HCCHAR13_EPNUM      (0xFu<<11)
#define OTG2_HS_HOST_OTG_HS_HCCHAR13_EPNUM_0    (0x1u<<11)
#define OTG2_HS_HOST_OTG_HS_HCCHAR13_MPSIZ      (0x7FFu<<0)
#define OTG2_HS_HOST_OTG_HS_HCCHAR13_MPSIZ_0    (0x1u<<0)

// OTG_HS_HCSPLT13 Configuration

#define OTG2_HS_HOST_OTG_HS_HCSPLT13_SPLITEN    (0x1u<<31)
#define OTG2_HS_HOST_OTG_HS_HCSPLT13_COMPLSPLT  (0x1u<<16)
#define OTG2_HS_HOST_OTG_HS_HCSPLT13_XACTPOS    (0x3u<<14)
#define OTG2_HS_HOST_OTG_HS_HCSPLT13_XACTPOS_0  (0x1u<<14)
#define OTG2_HS_HOST_OTG_HS_HCSPLT13_HUBADDR    (0x7Fu<<7)
#define OTG2_HS_HOST_OTG_HS_HCSPLT13_HUBADDR_0  (0x1u<<7)
#define OTG2_HS_HOST_OTG_HS_HCSPLT13_PRTADDR    (0x7Fu<<0)
#define OTG2_HS_HOST_OTG_HS_HCSPLT13_PRTADDR_0  (0x1u<<0)

// OTG_HS_HCINT13 Configuration

#define OTG2_HS_HOST_OTG_HS_HCINT13_DTERR       (0x1u<<10)
#define OTG2_HS_HOST_OTG_HS_HCINT13_FRMOR       (0x1u<<9)
#define OTG2_HS_HOST_OTG_HS_HCINT13_BBERR       (0x1u<<8)
#define OTG2_HS_HOST_OTG_HS_HCINT13_TXERR       (0x1u<<7)
#define OTG2_HS_HOST_OTG_HS_HCINT13_NYET        (0x1u<<6)
#define OTG2_HS_HOST_OTG_HS_HCINT13_ACK         (0x1u<<5)
#define OTG2_HS_HOST_OTG_HS_HCINT13_NAK         (0x1u<<4)
#define OTG2_HS_HOST_OTG_HS_HCINT13_STALL       (0x1u<<3)
#define OTG2_HS_HOST_OTG_HS_HCINT13_AHBERR      (0x1u<<2)
#define OTG2_HS_HOST_OTG_HS_HCINT13_CHH         (0x1u<<1)
#define OTG2_HS_HOST_OTG_HS_HCINT13_XFRC        (0x1u<<0)

// OTG_HS_HCINTMSK13 Configuration

#define OTG2_HS_HOST_OTG_HS_HCINTMSK13_DTERRM   (0x1u<<10)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK13_FRMORM   (0x1u<<9)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK13_BBERRM   (0x1u<<8)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK13_TXERRM   (0x1u<<7)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK13_NYET     (0x1u<<6)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK13_ACKM     (0x1u<<5)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK13_NAKM     (0x1u<<4)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK13_STALLM   (0x1u<<3)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK13_AHBERR   (0x1u<<2)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK13_CHHM     (0x1u<<1)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK13_XFRCM    (0x1u<<0)

// OTG_HS_HCTSIZ13 Configuration

#define OTG2_HS_HOST_OTG_HS_HCTSIZ13_DPID       (0x3u<<29)
#define OTG2_HS_HOST_OTG_HS_HCTSIZ13_DPID_0     (0x1u<<29)
#define OTG2_HS_HOST_OTG_HS_HCTSIZ13_PKTCNT     (0x3FFu<<19)
#define OTG2_HS_HOST_OTG_HS_HCTSIZ13_PKTCNT_0   (0x1u<<19)
#define OTG2_HS_HOST_OTG_HS_HCTSIZ13_XFRSIZ     (0x7FFFFu<<0)
#define OTG2_HS_HOST_OTG_HS_HCTSIZ13_XFRSIZ_0   (0x1u<<0)

// OTG_HS_HCDMA13 Configuration

#define OTG2_HS_HOST_OTG_HS_HCDMA13_DMAADDR     (0xFFFFFFFFu<<0)
#define OTG2_HS_HOST_OTG_HS_HCDMA13_DMAADDR_0   (0x1u<<0)

// OTG_HS_HCCHAR14 Configuration

#define OTG2_HS_HOST_OTG_HS_HCCHAR14_CHENA      (0x1u<<31)
#define OTG2_HS_HOST_OTG_HS_HCCHAR14_CHDIS      (0x1u<<30)
#define OTG2_HS_HOST_OTG_HS_HCCHAR14_ODDFRM     (0x1u<<29)
#define OTG2_HS_HOST_OTG_HS_HCCHAR14_DAD        (0x7Fu<<22)
#define OTG2_HS_HOST_OTG_HS_HCCHAR14_DAD_0      (0x1u<<22)
#define OTG2_HS_HOST_OTG_HS_HCCHAR14_MC         (0x3u<<20)
#define OTG2_HS_HOST_OTG_HS_HCCHAR14_MC_0       (0x1u<<20)
#define OTG2_HS_HOST_OTG_HS_HCCHAR14_EPTYP      (0x3u<<18)
#define OTG2_HS_HOST_OTG_HS_HCCHAR14_EPTYP_0    (0x1u<<18)
#define OTG2_HS_HOST_OTG_HS_HCCHAR14_LSDEV      (0x1u<<17)
#define OTG2_HS_HOST_OTG_HS_HCCHAR14_EPDIR      (0x1u<<15)
#define OTG2_HS_HOST_OTG_HS_HCCHAR14_EPNUM      (0xFu<<11)
#define OTG2_HS_HOST_OTG_HS_HCCHAR14_EPNUM_0    (0x1u<<11)
#define OTG2_HS_HOST_OTG_HS_HCCHAR14_MPSIZ      (0x7FFu<<0)
#define OTG2_HS_HOST_OTG_HS_HCCHAR14_MPSIZ_0    (0x1u<<0)

// OTG_HS_HCSPLT14 Configuration

#define OTG2_HS_HOST_OTG_HS_HCSPLT14_SPLITEN    (0x1u<<31)
#define OTG2_HS_HOST_OTG_HS_HCSPLT14_COMPLSPLT  (0x1u<<16)
#define OTG2_HS_HOST_OTG_HS_HCSPLT14_XACTPOS    (0x3u<<14)
#define OTG2_HS_HOST_OTG_HS_HCSPLT14_XACTPOS_0  (0x1u<<14)
#define OTG2_HS_HOST_OTG_HS_HCSPLT14_HUBADDR    (0x7Fu<<7)
#define OTG2_HS_HOST_OTG_HS_HCSPLT14_HUBADDR_0  (0x1u<<7)
#define OTG2_HS_HOST_OTG_HS_HCSPLT14_PRTADDR    (0x7Fu<<0)
#define OTG2_HS_HOST_OTG_HS_HCSPLT14_PRTADDR_0  (0x1u<<0)

// OTG_HS_HCINT14 Configuration

#define OTG2_HS_HOST_OTG_HS_HCINT14_DTERR       (0x1u<<10)
#define OTG2_HS_HOST_OTG_HS_HCINT14_FRMOR       (0x1u<<9)
#define OTG2_HS_HOST_OTG_HS_HCINT14_BBERR       (0x1u<<8)
#define OTG2_HS_HOST_OTG_HS_HCINT14_TXERR       (0x1u<<7)
#define OTG2_HS_HOST_OTG_HS_HCINT14_NYET        (0x1u<<6)
#define OTG2_HS_HOST_OTG_HS_HCINT14_ACK         (0x1u<<5)
#define OTG2_HS_HOST_OTG_HS_HCINT14_NAK         (0x1u<<4)
#define OTG2_HS_HOST_OTG_HS_HCINT14_STALL       (0x1u<<3)
#define OTG2_HS_HOST_OTG_HS_HCINT14_AHBERR      (0x1u<<2)
#define OTG2_HS_HOST_OTG_HS_HCINT14_CHH         (0x1u<<1)
#define OTG2_HS_HOST_OTG_HS_HCINT14_XFRC        (0x1u<<0)

// OTG_HS_HCINTMSK14 Configuration

#define OTG2_HS_HOST_OTG_HS_HCINTMSK14_DTERRM   (0x1u<<10)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK14_FRMORM   (0x1u<<9)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK14_BBERRM   (0x1u<<8)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK14_TXERRM   (0x1u<<7)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK14_NYET     (0x1u<<6)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK14_ACKM     (0x1u<<5)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK14_NAKM     (0x1u<<4)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK14_STALLM   (0x1u<<3)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK14_AHBERR   (0x1u<<2)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK14_CHHM     (0x1u<<1)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK14_XFRCM    (0x1u<<0)

// OTG_HS_HCTSIZ14 Configuration

#define OTG2_HS_HOST_OTG_HS_HCTSIZ14_DPID       (0x3u<<29)
#define OTG2_HS_HOST_OTG_HS_HCTSIZ14_DPID_0     (0x1u<<29)
#define OTG2_HS_HOST_OTG_HS_HCTSIZ14_PKTCNT     (0x3FFu<<19)
#define OTG2_HS_HOST_OTG_HS_HCTSIZ14_PKTCNT_0   (0x1u<<19)
#define OTG2_HS_HOST_OTG_HS_HCTSIZ14_XFRSIZ     (0x7FFFFu<<0)
#define OTG2_HS_HOST_OTG_HS_HCTSIZ14_XFRSIZ_0   (0x1u<<0)

// OTG_HS_HCDMA14 Configuration

#define OTG2_HS_HOST_OTG_HS_HCDMA14_DMAADDR     (0xFFFFFFFFu<<0)
#define OTG2_HS_HOST_OTG_HS_HCDMA14_DMAADDR_0   (0x1u<<0)

// OTG_HS_HCCHAR15 Configuration

#define OTG2_HS_HOST_OTG_HS_HCCHAR15_CHENA      (0x1u<<31)
#define OTG2_HS_HOST_OTG_HS_HCCHAR15_CHDIS      (0x1u<<30)
#define OTG2_HS_HOST_OTG_HS_HCCHAR15_ODDFRM     (0x1u<<29)
#define OTG2_HS_HOST_OTG_HS_HCCHAR15_DAD        (0x7Fu<<22)
#define OTG2_HS_HOST_OTG_HS_HCCHAR15_DAD_0      (0x1u<<22)
#define OTG2_HS_HOST_OTG_HS_HCCHAR15_MC         (0x3u<<20)
#define OTG2_HS_HOST_OTG_HS_HCCHAR15_MC_0       (0x1u<<20)
#define OTG2_HS_HOST_OTG_HS_HCCHAR15_EPTYP      (0x3u<<18)
#define OTG2_HS_HOST_OTG_HS_HCCHAR15_EPTYP_0    (0x1u<<18)
#define OTG2_HS_HOST_OTG_HS_HCCHAR15_LSDEV      (0x1u<<17)
#define OTG2_HS_HOST_OTG_HS_HCCHAR15_EPDIR      (0x1u<<15)
#define OTG2_HS_HOST_OTG_HS_HCCHAR15_EPNUM      (0xFu<<11)
#define OTG2_HS_HOST_OTG_HS_HCCHAR15_EPNUM_0    (0x1u<<11)
#define OTG2_HS_HOST_OTG_HS_HCCHAR15_MPSIZ      (0x7FFu<<0)
#define OTG2_HS_HOST_OTG_HS_HCCHAR15_MPSIZ_0    (0x1u<<0)

// OTG_HS_HCSPLT15 Configuration

#define OTG2_HS_HOST_OTG_HS_HCSPLT15_SPLITEN    (0x1u<<31)
#define OTG2_HS_HOST_OTG_HS_HCSPLT15_COMPLSPLT  (0x1u<<16)
#define OTG2_HS_HOST_OTG_HS_HCSPLT15_XACTPOS    (0x3u<<14)
#define OTG2_HS_HOST_OTG_HS_HCSPLT15_XACTPOS_0  (0x1u<<14)
#define OTG2_HS_HOST_OTG_HS_HCSPLT15_HUBADDR    (0x7Fu<<7)
#define OTG2_HS_HOST_OTG_HS_HCSPLT15_HUBADDR_0  (0x1u<<7)
#define OTG2_HS_HOST_OTG_HS_HCSPLT15_PRTADDR    (0x7Fu<<0)
#define OTG2_HS_HOST_OTG_HS_HCSPLT15_PRTADDR_0  (0x1u<<0)

// OTG_HS_HCINT15 Configuration

