Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32H747/Includes/Registers/stm32H747_CM7_otg2_hs_host.h
#define OTG2_HS_HOST_OTG_HS_HCINT15_DTERR       (0x1u<<10)
#define OTG2_HS_HOST_OTG_HS_HCINT15_FRMOR       (0x1u<<9)
#define OTG2_HS_HOST_OTG_HS_HCINT15_BBERR       (0x1u<<8)
#define OTG2_HS_HOST_OTG_HS_HCINT15_TXERR       (0x1u<<7)
#define OTG2_HS_HOST_OTG_HS_HCINT15_NYET        (0x1u<<6)
#define OTG2_HS_HOST_OTG_HS_HCINT15_ACK         (0x1u<<5)
#define OTG2_HS_HOST_OTG_HS_HCINT15_NAK         (0x1u<<4)
#define OTG2_HS_HOST_OTG_HS_HCINT15_STALL       (0x1u<<3)
#define OTG2_HS_HOST_OTG_HS_HCINT15_AHBERR      (0x1u<<2)
#define OTG2_HS_HOST_OTG_HS_HCINT15_CHH         (0x1u<<1)
#define OTG2_HS_HOST_OTG_HS_HCINT15_XFRC        (0x1u<<0)

// OTG_HS_HCINTMSK15 Configuration

#define OTG2_HS_HOST_OTG_HS_HCINTMSK15_DTERRM   (0x1u<<10)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK15_FRMORM   (0x1u<<9)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK15_BBERRM   (0x1u<<8)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK15_TXERRM   (0x1u<<7)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK15_NYET     (0x1u<<6)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK15_ACKM     (0x1u<<5)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK15_NAKM     (0x1u<<4)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK15_STALL    (0x1u<<3)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK15_AHBERR   (0x1u<<2)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK15_CHHM     (0x1u<<1)
#define OTG2_HS_HOST_OTG_HS_HCINTMSK15_XFRCM    (0x1u<<0)

// OTG_HS_HCTSIZ15 Configuration

#define OTG2_HS_HOST_OTG_HS_HCTSIZ15_DPID       (0x3u<<29)
#define OTG2_HS_HOST_OTG_HS_HCTSIZ15_DPID_0     (0x1u<<29)
#define OTG2_HS_HOST_OTG_HS_HCTSIZ15_PKTCNT     (0x3FFu<<19)
#define OTG2_HS_HOST_OTG_HS_HCTSIZ15_PKTCNT_0   (0x1u<<19)
#define OTG2_HS_HOST_OTG_HS_HCTSIZ15_XFRSIZ     (0x7FFFFu<<0)
#define OTG2_HS_HOST_OTG_HS_HCTSIZ15_XFRSIZ_0   (0x1u<<0)

// OTG_HS_HCDMA15 Configuration

#define OTG2_HS_HOST_OTG_HS_HCDMA15_DMAADDR     (0xFFFFFFFFu<<0)
#define OTG2_HS_HOST_OTG_HS_HCDMA15_DMAADDR_0   (0x1u<<0)
